/* 
  Localizable.strings (English)
  AMD Power Gadget
*/

/* NOTE: Some keys use Spanish text for historical reasons. */
/* These are used as lookup identifiers and work correctly. */
/* A future refactor should standardize all keys to English. */

"Dashboard" = "Instrumentpanel";
"Telemetry" = "Telemetri";
"Fan Control" = "Fläktkontroll";
"Profiles" = "Profiles";
"Advanced" = "Avancerat";
"Menu Bar" = "Menyfält";
"System Info" = "Systeminformation";
"Desktop Widgets" = "Skrivbords widgetar";

"AMD Power" = "AMD Effekt";
"Gadget" = "Gadget";

"CPU" = "CPU";
"GPU" = "GPU";
"Freq" = "Freq";
"Average" = "Genomsnittlig";
"Avg: %@" = "Genomsnitt: %@";
"Collecting data…" = "Samlar in data…";

"Low Power Mode (LPM)" = "Låg effektnivå (LPM)";
"Allows macOS to auto-manage CPU frequency" = "Tillåter macOS att auto-hantera CPU-frekvens";
"Forces CPU to lowest frequency for minimum power" = "Tvingar CPU till lägsta frekvens för minsta möjliga effekt";
"Core Performance Boost (CPB)" = "Prestandaförstärkning (CPB)";
"Update Interval" = "Uppdatera intervall";
"Adjust how frequently telemetry data updates. Lower = more responsive, higher = less CPU usage." = "Justera hur ofta telemetri data-uppdateringar. Lägre = mer lyhörd, högre = mindre CPU-användning.";

"Opciones en Menú Bar" = "Menyfält alternativ";
"Choose which items appear in the menu bar. Changes apply immediately." = "Välj vilka objekt som visas i menyraden. Ändringar gäller omedelbart.";
"Customize the visual appearance of the menu bar items." = "Anpassa det visuella utseendet på menyradens objekt.";
"Límite de Temp de Alerta" = "Gräns för varningstemp";
"Color de Alerta de Temp" = "Alert Temp Färg";
"Color de Flechas" = "Pilar Färg";
"Additional telemetry for the menu bar." = "Ytterligare telemetri för menyraden.";
"GPU data is shown inside Temp, Power, Memory and Fan columns when enabled." = "GPU-data visas i kolumnerna Temp, Power, Memory och Fan när aktiverad.";
"Show GPU VRAM" = "Visa GPU VRAM";
"G:X.XG in Memory column" = "G:X.XG i Minneskolumn";
"Show GPU Fan Speed" = "Visa GPU fläkthastighet";
"G:XXXX in Fan column" = "G:XXXX i fläktkolumn";

"No fans detected." = "Inga fläktar upptäckta.";
"SMC driver not available" = "SMC-förare är inte tillgänglig";
"Your SMC chip may not be supported." = "Ditt SMC-chip kanske inte stöds.";
"RPM" = "Varvtal";
"Throttle" = "Trottel";
"↩ Reset to Auto" = "↩️ Återställ till Auto";

"Select a profile to adjust the CPU operating range. Changes take effect immediately." = "Välj en profil för att justera processorns användningsområde. Ändringar träder i kraft omedelbart.";

"Directly edit raw P-State registers. Requires kext privilege check disabled via boot-arg or root." = "Redigera rå P-State register direkt. Kräver kext-privilegiekontroll inaktiverad via boot-arg eller root.";
"This will write the raw P-State definitions directly to the CPU. Proceed?" = "Detta kommer att skriva den råa P-State definitioner direkt till CPU. Fortsätt?";
"Disabled — work in progress" = "Inaktiverad — pågående arbete";
"WIP" = "WIP";

"Enable in OC: Misc → Security → ExposeSensitiveData = 0x08" = "Aktivera i OC: Övrigt → Säkerhet → ExposeSensitiveData = 0x08";
"Motherboard info not available" = "Moderkortsinformation är inte tillgänglig";

"Vista previa de la Barra de Menús:" = "Förhandsgranskning av menyraden:";
"Ancho estimado: %dpt" = "Uppskattad bredd: %dpt";
"Restart the app to fully apply width changes." = "Starta om appen för att tillämpa breddändringarna.";
"Small (%dpt)" = "Liten (%dpt)";
"Medium (%dpt)" = "Medium (%dpt)";
"Large (%dpt)" = "Stor (%dpt)";

"Green" = "Grön";
"Blue" = "Blå";
"Orange" = "Orange";
"Red" = "Röd";
"Purple" = "Lila";
"Pink" = "Rosa";
"Teal" = "Kricka";
"Turquoise" = "Turquoise";

"Verde" = "Grön";
"Azul" = "Blå";
"Naranja" = "Orange";
"Rojo" = "Röd";
"Morado" = "Lila";
"Rosa" = "Rosa";
"Turquesa" = "Kricka";

"Dynamic Colors (Temp Only)" = "Dynamiska färger (endast temp)";
"Temp Alert Color" = "Temp Alert Färg";
"Temp Alert Limit" = "Gräns för Temp Alert";
"Network" = "Nätverk";
"Network Arrows Color" = "Färg på nätverkspilar";
"Exit" = "Avsluta";
"AMD Power Gadget" = "AMD Power Pryl";
"AMD Power Tool" = "AMD Power Tool";
"SMC Fans" = "SMC fläktar";

"Fan 1" = "Fläkt 1";
"Fan 2" = "Fläkt 2";
"Fan 3" = "Fläkt 3";
"Fan 4" = "Fläkt 4";
"Fan 5" = "Fläkt 5";
"Fan 6" = "Fläkt 6";
"Fan 7" = "Fläkt 7";
"Fan 8" = "Fläkt 8";

/* Alerts */
"To enable motherboard display:" = "Aktivera moderkortsdisplay:";
"Open your OpenCore config file,\n\nGo to Misc -> Security -> ExposeSensitiveData,\n\nSet the value to 0x08 to expose board information." = "Öppna din OpenCore-konfigurationsfil,\n\nGå till Övrigt -> Säkerhet -> ExposeSensitiveData,\n\nSätt värdet till 0x08 för att exponera tavelinformation.";
"Done" = "Klar";
"Invalid Input" = "Invalid Input";
"Please type in numbers in hexadecimal." = "Skriv in siffror i hexadecimal.";
"Unable to Set PStateDef" = "Det går inte att ställa in PStateDef";
"Action was denied as current user does not have enough privilege,\nor was canceled by current user.\n\nRun AMD Power Gadget as root user or disable privilege check with boot-arg '-amdpnopchk'\n\nOtherwise, click 'Once' in the warning message to allow this change." = "Åtgärden nekades eftersom nuvarande användare inte har tillräckligt med behörighet,\neller avbröts av nuvarande användare.\n\nKör AMD Power Gadget som root-användare eller inaktivera behörighetskontroll med boot-arg '-amdpnopchk'\n\nAnnars, klicka på 'En gång' i varningsmeddelandet för att tillåta denna ändring.";
"Your changes will not be saved" = "Dina ändringar kommer inte att sparas";
"Click apply to save changes before closing this windows." = "Klicka på Verkställ för att spara ändringar innan du stänger fönstret.";
"Cancel" = "Avbryt";
"Close without saving" = "Stäng utan att spara";
"Invalid File" = "Ogiltig fil";
"The selected file could not be read or is not a valid pstate file." = "Den valda filen kunde inte läsas eller är inte en giltig pstate fil.";
"OK" = "Ok";

/* Dynamic format strings */
"Avg: %.2f GHz, Max: %.2f GHz" = "Avg: %.2f GHz, Max: %.2f GHz";
"%.2f °C" = "%.2f °C";
"%.2f Watt" = "%.2f W";

/* Session Peaks */
"Session Peaks" = "Sessionstoppar";
"Reset Peaks" = "Återställ toppar";

/* GPU Fan Control */
"GPU Fan Control (Zero RPM / Curves)" = "GPU fläktkontroll (noll varv/min / kurvor)";
"macOS Hardware Limitation" = "macOS maskinvarubegränsning";
"Direct software-based GPU fan speed overrides (such as zero-rpm toggle or drawing fan curves in macOS) are not supported by the macOS kernel/IOKit driver for AMD GPUs. The GPU's onboard firmware (vBIOS) manages the fans." = "Direktprogramvarubaserad GPU-fläkthastighet åsidosätter (t.ex. noll-rpm växla eller rita fläktkurvor i macOS) stöds inte av macOS kernel/IOKit-drivrutinen för AMD GPU:er. GPU:ns inbyggda firmware (vBIOS) hanterar fans.";
"Standard Hackintosh Solution:" = "Standard Hackintosh Lösning:";
"The only way to modify this behavior (like forcing fans to spin at lower temperatures or disabling Zero RPM) is by exporting the vBIOS, creating a Soft PowerPlay Table (SPPT), and injecting it via OpenCore's config.plist under DeviceProperties." = "Det enda sättet att ändra detta beteende (som att tvinga fans att snurra vid lägre temperaturer eller inaktivera noll RPM) är genom att exportera vBIOS, skapa en Soft PowerPlay-tabell (SPPT), och injicera den via OpenCores konfiguration. lista under DeviceProperties.";
"Open SPPT Guide" = "Öppna SPPT-guide";
"MorePowerTool" = "MorePowerTool";

/* CPPC & EPP */
"Native CPPC Active Mode (EPP)" = "Inhemskt CPPC Active Mode (EPP)";
"Enables autonomous hardware frequency scaling (recommended)" = "Aktiverar autonom frekvens (rekommenderas)";
"Power Management Mode" = "Power Management Mode";
"Energy Preference (EPP)" = "Energipreferens (EPP)";
"Select a hardware autonomous profile. The CPU will scale frequency dynamically." = "Välj en autonom hårdvaruprofil. Processorn kommer att skala frekvens dynamiskt.";
"Performance" = "Prestation";
"Balanced Perf" = "Balanserad Perf";
"Balanced Power" = "Balanserad kraft";
"Power Save" = "Spara ström";
"Active Profile Status" = "Aktiv profilstatus";
"CPU Speed Profiles (Legacy)" = "CPU Speed Profiler (Legacy)";
"Select a manual P-State override profile. Frequencies will be restricted to the selected step." = "Välj en manuell P-State åsidosättningsprofil. Frekvenser begränsas till det valda steget.";
"Mode" = "Läge";
"EPP Profile" = "EPP profil";

/* Desktop Widgets */
"Show CPU Widget" = "Visa CPU-widget";
"Show GPU Widget" = "Visa GPU-widget";
"Show RAM Widget" = "Show RAM Widget";
"Show Disk Widget" = "Visa diskwidget";
"Show Network Widget" = "Visa nätverkswidget";
"Show Fan Widget" = "Visa fläktwidget";
"Disable All Widgets" = "Inaktivera alla widgetar";
"Sort by Rank" = "Sortera efter rang";
"Edit Widget Layout" = "Redigera widget-layout";
"Unlock widgets to drag them around the screen" = "Lås upp widgetar för att dra dem runt på skärmen";
"Widget Options" = "Widget alternativ";
"Customize the appearance and behavior of your desktop widgets." = "Anpassa utseende och beteende på skrivbordet widgetar.";
"Auto-Align Active Widgets" = "Justera aktiva widgetar automatiskt";
"Automatically stack active widgets at a corner" = "Stapla automatiskt aktiva widgets i ett hörn";
"Alignment Corner" = "Justering Hörn";
"Top Right" = "Överst till höger";
"Top Left" = "Överst till vänster";
"Bottom Right" = "Nederst till höger";
"Bottom Left" = "Nederst till vänster";
"Show Clock Widget" = "Visa klockans widget";
"Clock" = "Klocka";
"Stats Table" = "Statistik Tabell";
"Classic Glass" = "Klassiskt glas";
"Pro Monitor" = "Pro Monitor";
"Core Matrix" = "Kärnmatris";

"United" = "Förenat";
"Show United Widget" = "Visa enad widget";
"Configure Combined Metrics" = "Konfigurera kombinerade mätvärden";
"Include CPU" = "Inkludera CPU";
"Include GPU" = "Inkludera GPU";
"Include RAM" = "Inkludera RAM";
"Include Disk" = "Inkludera disk";
"Include Network" = "Inkludera nätverk";
"Include Fan" = "Inkludera fläkt";

"Temas & Apariencia" = "Teman och utseende";
"Análisis" = "Analys";

"Select Visual Theme (Instant Application)" = "Välj visuellt tema (snabbprogram)";
"Custom Theme Creator & Exchange (JSON)" = "Anpassad Tema Skapare & Utbyte (JSON)";
"Chart Rendering Style" = "Stil på sjökortsrendering";
"Custom Theme Editor" = "Anpassad tema-redigerare";
"Showing active theme colors. Adjust any color to customize." = "Visar aktiva tema färger. Justera valfri färg för att anpassa.";
"Use the Opacity slider for transparency (macOS color panel alone often resets alpha)." = "Använd Opacitet reglaget för transparens (macOS färgpanel ensam återställer ofta alfa).";
"Opacity" = "Genomskinlighet";
"Edit Active Theme" = "Redigera aktivt tema";
"Export Theme (JSON)" = "Exportera tema (JSON)";
"Import Theme (JSON)" = "Importera tema (JSON)";
"Card Background" = "Kort bakgrund";
"Cyan Accent" = "Turkos Accent";
"Orange Accent" = "Orange Accent";
"Green Accent" = "Grönt Accent";
"Purple Accent" = "Lila Accent";

/* ===== Auto-extracted / curated for Crowdin (v3.16.1+) ===== */
"%.0f" = "%.0f";
"%.0f K/s" = "%.0f K/s";
"%.0f MHz" = "%.0f MHz";
"%.0f%%" = "%.0f%%";
"%.0fG" = "%.0fG";
"%.0f°" = "%.0f°";
"%.0f°C" = "%.0f°C";
"%.0f°C • %.0fW" = "%.0f°C • %.0fW";
"%.1f %@" = "%.1f %@";
"%.1f Ghz" = "%.1f Ghz";
"%.1f M/s" = "%.1f M/s";
"%.1f s" = "%.1f s";
"%.1f%%" = "%.1f%%";
"%.1f°C" = "%.1f°C";
"%.2f GHz" = "%.2f GHz";
"%.3f V" = "%.3f V";
"%.4f V" = "%.4f V";
"100°C" = "100°C";
"1h" = "1 tim";
"24h" = "24t";
"30d" = "30d";
"60°C" = "60 °C";
"7d" = "7d";
"Accept & Continue" = "Godkänn och fortsätt";
"Active" = "Aktiv";
"All Auto" = "Alla automatiska";
"All Combined" = "Alla kombinerade";
"All Fans Auto" = "Alla fläktar automatiskt";
"AMD CPU Cores" = "AMD CPU-kärnor";
"AMD Power Gadget recolecta datos automáticamente cada minuto." = "AMD Power Gadget recolecta datos automa<unk> ticamente cada minuto.";
"AMD Processor Power Manager (PPM)" = "AMD-processorn Power Manager (PPM)";
"Analysis" = "Analys";
"Apply" = "Tillämpa";
"Apply P-States?" = "Tillämpa P-stater?";
"Arrange the order in which resource widgets appear. Click arrows to swap position." = "Ordna ordningen i vilken resurs widgetar visas. Klicka på pilarna för att byta position.";
"Arrow Color" = "Pil Färg";
"Automatically switches EPP profiles based on live CPU load" = "Automatiskt växlar EPP-profiler baserade på levande CPU-belastning";
"Average core frequency in GHz" = "Genomsnittlig kärnfrekvens i GHz";
"Average utilization over time" = "Genomsnittlig användning över tid";
"Avg Frequency" = "Genomsnittlig frekvens";
"Avg." = "Genomsnittlig";
"Avg: %.0f%%" = "Genomsnitt: %.0f%%";
"Balanced\n%.1f GHz" = "Balanserad\n%.1f GHz";
"Base\n%.1f GHz" = "Base\n%.1f GHz";
"BIOS / Auto" = "BIOS / Auto";
"Buscando actualizaciones..." = "Buscando actualizaciones...";
"Bytes (Read)" = "Bytes (Läs)";
"Bytes (Write)" = "Bytes (rit)";
"Cargando tendencias de telemetría..." = "Cargando tendencias de telemetría...";
"Chart Metric" = "Diagram Metrisk";
"Chart Type" = "Typ av diagram";
"Charts require macOS 13+" = "Sjökort kräver macOS 13+";
"Charts require macOS 13.0+" = "Sjökort kräver macOS 13.0+";
"Check for new releases of SMCAMDProcessor and AMD Power Gadget on GitHub." = "Sök efter nya versioner av SMCAMDProcessor och AMD Power Gadget på GitHub.";
"Check for Updates" = "Sök efter uppdateringar";
"Check Now" = "Kontrollera nu";
"Circular Ring" = "Cirkulär ring";
"Column Bars" = "Kolumn staplar";
"Configure Charts" = "Konfigurera sjökort";
"Configure labels and layout details for widgets inside the popover." = "Konfigurera etiketter och layoutdetaljer för widgetar inuti popovern.";
"Connection Error: %@" = "Anslutningsfel: %@";
"Continuous Background Logging" = "Kontinuerlig bakgrundsloggning";
"Continuously write telemetry samples to a CSV file in the background" = "Skriv kontinuerligt telemetri prover till en CSV-fil i bakgrunden";
"Control Mode" = "Kontroll läge";
"Core Rankings (Estimated by Freq)" = "Kärnrangemang (uppskattad av Freq)";
"Could not fetch release info." = "Kunde inte hämta release info.";
"CPPC hardware rankings are active and loaded from the processor." = "CPPC hårdvaruranking är aktiv och laddad från processorn.";
"CPPC hardware values could not be read. Rankings are estimated from the maximum observed clock frequency of each core." = "CPPC-hårdvaruvärden kunde inte läsas. Rankingen uppskattas från den högsta observerade klockfrekvensen i varje kärna.";
"CPPC Preferred Cores (Silicon Quality)" = "CPPC föredragna kärnor (kiselkvalitet)";
"CPPC: Active" = "CPPC: HW OK";
"CPPC: Estimated" = "CPPC: Uppskattad";
"CPU and GPU temperatures" = "Temperaturer för CPU och GPU";
"CPU Average Frequency" = "CPU genomsnittlig frekvens";
"CPU Freq Avg (GHz)" = "CPU Freq Avg (GHz)";
"CPU Frequency" = "CPU Frekvens";
"CPU Load" = "Ladda CPU";
"CPU Load (%)" = "CPU-belastning (%)";
"CPU Package Power" = "CPU-paket Kraft";
"CPU Per-Core Thread Load" = "CPU Per-Core trådbelastning";
"CPU Power" = "CPU Effekt";
"CPU Power (W)" = "CPU Effekt (W)";
"CPU Power Alert" = "CPU Power Alert";
"CPU power has been at %.1fW (above limit of %dW) for over %d seconds!" = "CPU-ström har varit på %.1fW (över gränsen för %dW) i över %d sekunder!";
"CPU Temp" = "CPU Temp";
"CPU Temp (°C)" = "CPU Temp (°C)";
"CPU Temperature" = "CPU Temperatur";
"CPU Temperature Alert" = "Varning för CPU-temperatur";
"CPU temperature has reached %.1f°C!" = "CPU-temperaturen har nått %.1f°C!";
"CPU Tracker" = "CPU Tracker";
"Current version: v%@\nNew version: %@\n\nRelease Notes:\n%@" = "Aktuell version: v%@\nNy version: %@\n\nUtgåvor:\n%@";
"Curve" = "Kurva";
"Curve Optimizer is only active when the AMDRyzenCPUPowerManagement kext supports Zen 3 SMU mailbox interface." = "Curve Optimizer är bara aktiv när AMDRyzenCPUPowerManagement kext stöder Zen 3 SMU brevlåda gränssnitt.";
"Custom" = "Anpassad";
"Customize the behavior and visibility of the menu bar popover." = "Anpassa beteendet och synligheten av menyraden popover.";
"Cyberpunk Neon" = "Cyberpunk Neon";
"Delete Point" = "Ta bort punkt";
"Device Utilization %" = "Utnyttjande av enhet %";
"Disable heavy visual effects if your system lacks Metal graphics acceleration." = "Inaktivera tunga visuella effekter om ditt system saknar Metallgrafik acceleration.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user." = "DISCLAIMER: Denna programvara interagerar direkt med låg nivå hårdvarukontroll register. Genom att använda det, samtycker du till att absolut ansvar för alla system instabilitet, hårdvaruskador eller främmande invasion ligger helt hos användaren.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility rests entirely with the user." = "DISCLAIMER: Denna programvara interagerar direkt med låg nivå hårdvarukontroll register. Genom att använda den, samtycker du till att absolut ansvar vilar helt på användaren.";
"Disk" = "Diskett";
"DISK" = "RABATT";
"Disk Activity" = "Disk aktivitet";
"Disk Activity (MB/s)" = "Diskaktivitet (MB/s)";
"Disk Activity (Read+Write)" = "Diskaktivitet (läs+skriv)";
"Disk I/O" = "Disk-I/O";
"Disk Tracker" = "Diskspårare";
"Do you want AMD Power Gadget to start in menu bar at login? \n\n This will only be asked once. You can change this setting later under Appearance menu." = "Vill du att AMD Power Gadget ska starta i menyraden vid inloggning? \n\n Detta kommer bara att bli tillfrågat en gång. Du kan ändra denna inställning senare under Utseende-menyn.";
"Donate (PayPal)" = "Donera (PayPal)";
"Download" = "Hämta";
"Download on GitHub" = "Ladda ner på GitHub";
"Download Update" = "Ladda ner uppdatering";
"Drag control points to edit curve. Double-click empty space to add (max 8). Double-click a point or right-click to delete." = "Dra kontrollpunkter för att redigera kurvan. Dubbelklicka på tomt utrymme för att lägga till (max 8). Dubbelklicka på en punkt eller högerklicka för att ta bort.";
"Dynamic Auto-EPP Workload Engine" = "Dynamisk automatisk EPP arbetsbelastning Motor";
"Dynamic Next-Gen Fan Curves" = "Dynamiska nästa-Gen fläktkurvor";
"Edit Layout" = "Redigera layout";
"Efficient\n%.1f GHz" = "Effektiv\n%.1f GHz";
"Enable additional stats columns inside the popover." = "Aktivera ytterligare statistikkolumner inne i poven.";
"Enable System Alerts" = "Aktivera systemvarningar";
"Error reading CPU data." = "Fel vid läsning av CPU-data.";
"Evaluated in the kernel with 256-step LUT interpolation, hysteresis, and smooth ramping." = "Utvärderad i kärnan med 256-stegs LUT-interpolering, hysteres och smidig rampning.";
"Export" = "Exportera";
"Export CSV" = "Exportera CSV";
"Export Telemetry History" = "Exportera telemetri historik";
"Export the history of samples currently in memory to a CSV file" = "Exportera historiken över prover som för närvarande finns i minnet till en CSV-fil";
"Failed — check kext privileges (-amdpnopchk)." = "Misslyckades — kontrollera kext-rättigheter (-amdpnopchk).";
"Fan" = "Fläkt";
"Fan Number" = "Fläktnummer";
"Fan Speed" = "Fläkthastighet";
"Fan Speed (RPM)" = "Fläkthastighet (RPM)";
"Fan Speed(RPM)" = "Fläkthastighet (RPM)";
"Filled Area" = "Fyllt område";
"Freq:" = "Frekvens:";
"Frequency" = "Frekvens";
"Frequency Max:" = "Frekvens Max:";
"GHz" = "GHz";
"GitHub Repository" = "GitHub Repository";
"GitHub Repository\n\nSpecial thanks to the AMD OS X community!\n\nCopyright © 2020-2026 Droga. All rights reserved." = "GitHub Repository\n\nSpecial thanks to the AMD OS X community!\n\nCopyright ©️ 2020-2026 Droga. All rights reserved.";
"GPU Load" = "GPU laddning";
"GPU Model" = "GPU Modell";
"GPU Power" = "GPU Effekt";
"GPU Power (W)" = "GPU effekt (W)";
"GPU Temp" = "GPU Temp";
"GPU Temp (°C)" = "GPU Temp (°C)";
"GPU Temperature" = "GPU Temperatur";
"GPU Tracker" = "GPU Tracker";
"H.264 & HEVC Active" = "H.264 & HEVC aktiv";
"H.264 Active (HEVC Inactive)" = "H.264 Aktiv (HEVC Inaktiv)";
"HEVC Active (H.264 Inactive)" = "HEVC Aktiv (H.264 Inaktiv)";
"Hide this fan" = "Dölj denna fläkt";
"High Load Threshold (Performance)" = "Hög belastning tröskel (prestanda)";
"Histograma de Barras" = "Histograma de Barras";
"Hysteresis" = "Hysteresis";
"I accept that absolute responsibility lies entirely with the user." = "Jag accepterar att det är helt och hållet användarens ansvar.";
"Idle Threshold (Power Save)" = "Inaktiv tröskel (Power Save)";
"Import" = "Importera";
"Inactive" = "Inaktiv";
"Inactive / Not Supported" = "Inaktiv / stöds inte";
"Index" = "Index";
"Inject positive or negative voltage offsets per core. Center is 0 (no override). Limit: -30 (undervolt) to +30 (overvolt) counts." = "Injicera positiva eller negativa spänningsförskjutningar per kärna. Center är 0 (ingen åsidosättning). Gräns: -30 (undervolt) till +30 (övervolt) räknas.";
"Inst(s) Retired:" = "Instans(er) Uttröttade:";
"Kext Update Available" = "Kext-uppdatering tillgänglig";
"Later" = "Senare";
"Line Only" = "Endast Linje";
"Load" = "Ladda";
"Loading..." = "Laddar...";
"Log File Location" = "Logga Fil Plats";
"Logical Cores" = "Logiska kärnor";
"Low Performance Mode" = "Låg prestanda läge";
"Low Power\n%.1f GHz" = "Låg effekt\n%.1f GHz";
"Línea Escalonada (Step)" = "Escalonada (steg)";
"Línea Suave (Spline)" = "Lilla nea Suave (Spline)";
"Manual Override" = "Manuell åsidosättning";
"Max Speed" = "Max hastighet";
"Max." = "Max.";
"MB/s" = "MB/s";
"Memory Usage" = "Minnesanvändning";
"Menu Bar Preview:" = "Förhandsgranskning av menyraden:";
"Mi Tema Custom" = "Mi Tema Anpassad";
"Min." = "Min.";
"Monochrome Stealth" = "Monokrom Smygd";
"Máx." = "Ma<unk> x.";
"Máx:" = "Ma<unk> x:";
"Mín." = "Blandad";
"Mín:" = "Blandning:";
"N/A" = "N/A";
"Net" = "Netto";
"Net Download (MB/s)" = "Nettonedladdning (MB/s)";
"Net Upload (MB/s)" = "Nettouppladdning (MB/s)";
"Network Speed" = "Nätverkets hastighet";
"Network Throughput" = "Nätverk genomströmning";
"Network Total Speed" = "Nätverkets totala hastighet";
"New version %@ available!" = "Ny version %@ tillgänglig!";
"New Version Available: %@" = "Ny version tillgänglig: %@";
"No" = "Nej";
"No AMDRyzenCPUPowerManagement Found!" = "Ingen AMDRyzenCPUPowerManagement hittades!";
"No curves configured." = "Inga kurvor konfigurerade.";
"No hay suficientes datos recolectados aún." = "No hay suficientes datos recolectados aún.";
"No location selected" = "Ingen plats vald";
"No metrics active" = "Inga värden aktiva";
"No release notes available." = "Inga versionsfakta tillgängliga.";
"Nordic Frost" = "Nordic Frost";
"Not Supported" = "Stöds inte";
"Not supported by your CPU" = "Stöds inte av din CPU";
"Not yet" = "Inte ännu";
"Open Dashboard" = "Öppna instrumentpanelen";
"Other Popover Widgets" = "Andra popover-widgetar";
"P-State Editor" = "P-State Editor";
"P-States applied successfully." = "P-States tillämpas framgångsrikt.";
"P-States Configuration" = "P-States konfiguration";
"Package" = "Paket";
"Package Power" = "Paketets Kraft";
"Peak Fan" = "Toppfläkt";
"Peak Freq" = "Peak Freq";
"Peak Power" = "Högsta Kraft";
"Peak Temp" = "Toppfrekvens";
"Performance\n%.1f GHz" = "Prestanda\n%.1f GHz";
"Performance & Fallback" = "Prestanda & Fallback";
"Personalizado" = "Personalizado";
"Physical Cores" = "Fysiska kärnor";
"Pin Popover Open" = "Pin popover öppen";
"Platform" = "Plattform";
"Please download AMDRyzenCPUPowerManagement from the release page." = "Vänligen ladda ner AMDRyzenCPUPowerManagement från releasesidan.";
"Popover Config" = "Popover Config";
"Popover General Settings" = "Popover Allmänna inställningar";
"Popover Menu" = "Popover Menu";
"Power" = "Ström";
"Power Warning Threshold (PPT)" = "Tröskelvärde för kraftvarning (PPT)";
"Prevent the popover from closing when clicking outside" = "Förhindra att popopover stängs när du klickar utanför";
"Preview" = "Förhandsgranska";
"Processor" = "Processor";
"Profile" = "Profil";
"Progress Bar" = "Förloppsindikator";
"Prom." = "Prom.";
"PWR" = "PWR";
"Quick Fan Access" = "Snabb åtkomst till fläkt";
"Quit" = "Avsluta";
"Quit and Download" = "Avsluta och ladda ner";
"Radeon GPU" = "Radeon GPU";
"Radeon Graphics utilization percentage" = "Radeon Grafik utnyttjande procent";
"RAM" = "RAM";
"RAM Tracker" = "RAM Tracker";
"RAM Usage" = "RAM Usage";
"RAM Usage (%)" = "RAM Usage (%)";
"RAM Utilization" = "RAM Utilization";
"RAM utilization percentage" = "RAM-användning procent";
"Ramp Rate" = "Ramp hastighet";
"Raw Register Details" = "Rå registeruppgifter";
"Read Speed" = "Läsa hastighet";
"Real-time energy consumption in Watts" = "Energiförbrukning i watt i realtid";
"Real-time History" = "Historik i realtid";
"Real-time upload / download speed (↑/↓)" = "Uppladdning / nedladdningshastighet i realtid (<unk> /<unk> )";
"Receive native macOS alerts when the CPU exceeds configured thermal or power limits." = "Ta emot inbyggda macOS varningar när CPU överskrider konfigurerade termiska eller strömbegränsningar.";
"Refresh Rate" = "Uppdatera hastighet";
"Relative Time (s)" = "Relativ tid (er)";
"Replaces translucent blurs with solid colors to save CPU" = "Ersätter genomskinlig oskärpa med solida färger för att spara CPU";
"Requests permission and enables hardware limit warnings" = "Begär tillstånd och aktiverar varningar för hårdvarubegränsningar";
"Revert" = "Återgå";
"Right-click any widget directly on your desktop to change its style dynamically (Classic Glass, Pro Monitor, or Core Matrix)." = "Högerklicka på någon widget direkt på skrivbordet för att ändra sin stil dynamiskt (Classic Glass, Pro Monitor, eller Core Matrix).";
"SAFETY DISCLAIMER & LIABILITY AGREEMENT" = "SÄKERHET DISKLAIMER & ANVÄNDIGHET AGREEMENT";
"Seleccioná una gráfica en el panel superior para visualizar su histórico." = "Selecciona<unk> una gra<unk> fica en el panel överlägsen para visualizar su histo rico.";
"Select File..." = "Välj fil...";
"Select which metrics are shown and choose their visualization style." = "Välj vilka mätvärden som visas och välj deras visualiseringsstil.";
"Series" = "Serie";
"Show a floating, non-interactive widget on your desktop for live telemetry." = "Visa en flytande icke-interaktiv widget på skrivbordet för live-telemetri.";
"Show All (%d hidden)" = "Visa alla (%d dold)";
"Show CPU" = "Visa CPU";
"Show Fan RPM" = "Visa varvtal för fläkt";
"Show GPU Power" = "Visa GPU ström";
"Show GPU Row" = "Visa GPU-rad";
"Show GPU Temp" = "Visa GPU-Temp";
"Show Memory" = "Visa minne";
"Show Network" = "Visa nätverk";
"Show Network Row" = "Visa Nätverksrad";
"Show Network Speed Sparkline Graph below" = "Visa Glittringine Graph för nätverkshastighet nedan";
"Show Per-Core Utilization Grid below" = "Visa Per-Core utnyttjande rutnät nedan";
"Show Power" = "Visa ström";
"Show Ring Details" = "Visa ringdetaljer";
"Show Ring Labels" = "Visa ringetiketter";
"Show Temperature" = "Visa temperatur";
"Show Temperature Sparkline Graph below" = "Visa temperatur Gnistrande graf nedan";
"Show Top Processes" = "Visa toppprocesser";
"Single large value instead of max/avg stack" = "Enstaka stort värde istället för max/avg stack";
"SMC Fan Control" = "SMC fläktkontroll";
"Smooth Curves" = "Mjuka kurvor";
"Software" = "Programvara";
"Software Updates" = "Programuppdateringar";
"Solarized Amber" = "Solariserad bärnsten";
"Speed" = "Hastighet";
"SSD" = "SSD";
"Startup at login?" = "Starta vid inloggning?";
"Statistics" = "Statistik";
"Storage" = "Lagring";
"Style" = "Stil";
"Style Options" = "Stilalternativ";
"Styles & Themes" = "Styles & Themes";
"Supported by your CPU" = "Stöds av din CPU";
"Sustained Duration" = "Fortsatt varaktighet";
"Swap Total" = "Växla totalt";
"Swap Used" = "Byt använd";
"System Alert Notifications" = "Notiser för systemaviseringar";
"System Up to Date" = "System upp till datum";
"Tahoe Glass" = "Tahoe glas";
"Temp" = "Temp";
"Temp Source" = "Temp källa";
"Temperature" = "Temperatur";
"Temperature Warning Threshold" = "Temperaturvarning Tröskel";
"Temperature(C)" = "Temperatur(C)";
"Temperatures" = "Temperaturer";
"Themes & Appearance" = "Teman och utseende";
"Thermal History" = "Termisk historia";
"This application can not be launched due to AMDRyzenCPUPowerManagement is reporting incorrect data." = "Denna applikation kan inte startas på grund av AMDRyzenCPUPowerManagement rapporterar felaktiga data.";
"This software interacts directly with low-level CPU hardware registers, Model-Specific Registers (MSRs), and the System Management Unit (SMU) to control CPU voltages, frequencies, and power limits.\n\nIncorrect settings, unstable undervolting, or wrong configurations can cause system instability, data loss, kernel panics, or permanent hardware damage.\n\nBy continuing, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user. The authors and contributors assume no liability whatsoever for any damage, loss, or side effects to your hardware, software, or personal property. Use at your own risk." = "Denna programvara interagerar direkt med CPU hårdvaruregister, Modellspecifika register (MSR), och System Management Unit (SMU) för att styra CPU-spänningar, frekvenser och effektbegränsningar.\n\nFelaktiga inställningar, instabil undervolt eller felaktiga konfigurationer kan orsaka systeminstabilitet, dataförlust, kärnpanik eller permanent hårdvaruskada.\n\nGenom att fortsätta godkänner du att absolut ansvar för eventuella systeminstabilitet, maskinvaruskador eller utomjordisk invasion ligger helt hos användaren. Författarna och bidragsgivarna tar inget som helst ansvar för eventuella skador, förluster eller biverkningar på din hårdvara, programvara eller personliga egendom. Använd på egen risk.";
"Thread %d: %.1f%%" = "Tråd %d: %.1f%%";
"Time" = "Tid";
"Timeframe" = "Timeframe";
"Timestamp" = "Tidsstämpel";
"TMP" = "TMP";
"Todas las gráficas están ocultas." = "Todas las gráficas están ocultas.";
"Top Processes" = "Topp processer";
"Total" = "Totalt";
"Total Power(W)" = "Total effekt (W)";
"Tracks active memory usage and pressure." = "Spårar aktiv minnesanvändning och tryck.";
"Tracks CPU utilization average and core temperature." = "Spårar CPU-användning medel- och kärntemperatur.";
"Tracks graphics memory (VRAM) utilization." = "Spårar grafikminne (VRAM) användning.";
"Tracks graphics utilization and temperature." = "Spårar grafikutnyttjande och temperatur.";
"Tracks primary storage capacity usage." = "Spårar primär användning av lagringskapacitet.";
"Unknown" = "Okänd";
"Unknown GPU" = "Okänd GPU";
"Unlock Curve Optimizer (DANGEROUS: unstable undervolting can cause kernel panic or instant reboot)" = "Lås upp Curve Optimizer (DANGEROUS: unstable undervolting kan orsaka panik eller omedelbar omstart)";
"Unlock P-State Editor (DANGEROUS: incorrect settings can crash or damage hardware)" = "Lås upp P-State Editor (DANGEROUS: felaktiga inställningar kan krascha eller skada hårdvaran)";
"Upload" = "Ladda upp";
"Uptime" = "Drifttid";
"Use Popover Menu" = "Använd popopover meny";
"Used memory in GB" = "Använt minne i GB";
"Used RAM" = "Used RAM";
"UTC Time" = "UTC Tid";
"V-F Operating Curve" = "V-F arbetskurva";
"Value" = "Värde";
"VDA Decoder" = "VDA Avkodare";
"Visible charts:" = "Synliga diagram:";
"Volt:" = "Volt:";
"VRAM" = "VRAM";
"VRAM Tracker" = "VRAM Tracker";
"VRAM Used" = "VRAM används";
"VRAM: %.2fG%@" = "VRAM: %.2fG%@";
"W" = "W";
"Weekday" = "Veckodag";
"Widget Reordering" = "Ombeställning av widget";
"Widget Selection & Display Style" = "Val av widget och visningsstil";
"Widget Style" = "Widget stil";
"Write Speed" = "Skriv hastighet";
"Yes" = "Ja";
"You are running the most recent version of AMD Power Gadget (v%@)." = "Du kör den senaste versionen av AMD Power Gadget (v%@).";
"You have the latest version installed (v%@)." = "Du har den senaste versionen installerad (v%@).";
"°C" = "°C";
"Área Rellena (Gradient)" = "Rellena (Gradient)";

/* Compatibility / format keys */
"Your AMDRyzenCPUPowerManagement version (%@) is outdated and no longer API compatible. Please use version 3.0.0 or newer and start this application again." = "Din AMDRyzenCPUPowerManagement version (%@) är föråldrad och inte längre API-kompatibel. Använd version 3.0.0 eller senare och starta programmet igen.";

/* App language picker */
"Language" = "Språk";
"App Language" = "Appens språk";
"Choose the interface language. The app will restart to apply the change." = "Välj gränssnittets språk. Appen kommer att starta om för att tillämpa ändringen.";
"System Default" = "Systemets standard";
"Current: %@" = "Aktuellt: %@";
"Restart required" = "Omstart krävs";
"Apply & Restart" = "Tillämpa & starta om";
"The app needs to restart to load the selected language." = "Appen måste starta om för att ladda det valda språket.";

/* Privilege UX */
"This action requires administrator privileges. Run AMD Power Gadget as root, or add the boot argument -amdpnopchk for debugging." = "Denna åtgärd kräver administratörsrättigheter. Kör AMD Power Gadget som rot, eller lägg till startargumentet -amdpnopchk för felsökning.";

/* Crowdin: recent UI strings — CPPC badge vs EPP Active Mode */
"CPPC: HW OK" = "CPPC: HW OK";
"CPPC: EPP On" = "CPPC: EPP On";
"This CPU did not report CPPC support to the kext." = "This CPU did not report CPPC support to the kext.";
"If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). The green “CPPC: HW OK” badge only means rankings exist — it is not this switch." = "If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). The green “CPPC: HW OK” badge only means rankings exist — it is not this switch.";
"Native CPPC Active Mode (EPP) is ON. Cores scale autonomously; rankings come from the processor." = "Native CPPC Active Mode (EPP) is ON. Cores scale autonomously; rankings come from the processor.";
"CPPC hardware scores could not be read. Rankings are estimated from observed clocks. This is not the Profiles EPP toggle." = "CPPC hardware scores could not be read. Rankings are estimated from observed clocks. This is not the Profiles EPP toggle.";
"The CPU reports CPPC rankings (HW OK). That does not mean Active Mode is on — enable “Native CPPC Active Mode (EPP)” under Profiles (needs -amdpnopchk or root)." = "The CPU reports CPPC rankings (HW OK). That does not mean Active Mode is on — enable “Native CPPC Active Mode (EPP)” under Profiles (needs -amdpnopchk or root).";
/* Deprecated badge key — kept so old locales still resolve */
"CPPC: Active" = "CPPC: HW OK";

/* Menu Bar toggles (fabiosun IT) */
"Show Max Freq Only" = "Show Max Freq Only";

/* Menu Bar toggles (fabiosun IT) */
"Use Fahrenheit" = "Use Fahrenheit";

/* Menu Bar toggles (fabiosun IT) */
"Frequency column (max/avg GHz)" = "Frequency column (max/avg GHz)";

/* Menu Bar toggles (fabiosun IT) */
"CPU temp + optional GPU temp" = "CPU temp + optional GPU temp";

/* Menu Bar toggles (fabiosun IT) */
"Convert temperature values from Celsius to Fahrenheit" = "Convert temperature values from Celsius to Fahrenheit";

/* Menu Bar toggles (fabiosun IT) */
"CPU watts + optional GPU watts" = "CPU watts + optional GPU watts";

/* CPPC support gate */
"Active Mode and Auto-EPP stay off until the kext reports CPPC. Boot-arg -amdcppcactive alone is not enough if MSR/CPUID checks fail — reboot after updating kexts." = "Active Mode and Auto-EPP stay off until the kext reports CPPC. Boot-arg -amdcppcactive alone is not enough if MSR/CPUID checks fail — reboot after updating kexts.";
"AMDRyzenCPUPowerManagement kext not connected." = "AMDRyzenCPUPowerManagement kext not connected.";
"If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). With -amdcppcactive the kext enables Active Mode at boot after reboot." = "If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). With -amdcppcactive the kext enables Active Mode at boot after reboot.";
